# Bigquery using python

## 1

In [3]:
import os
import pandas as pd
from google.cloud import bigquery

In [4]:
os.environ['GOOGLE_APPLICATION_CREDENTIALS'] = 'D:\Sanket\Gcp\Excel\Key\sanket-c.json'

In [5]:
client = bigquery.Client()

In [6]:
tableName = client.get_table('sanket-c.Temp.customer_info')

In [7]:
try:
    if tableName:
        print('table is present')
except:
    print('table not found')

table is present

In [16]:
dataframeData = pd.read_gbq('sanket-c.Temp.customer_info')

In [19]:
import datetime
dataframeData['Todays_date'] = datetime.date.today()
# dataframeData['Todays_date'] = pd.to_datetime('today')

In [20]:
dataframeData

  customer_name zip_code                    email state Todays_date
0   Alice Jones     0000  alice.jones@example.com    TX  2024-03-29
1    Jane Smith     0000   jane.smith@example.com    NY  2024-03-29
2      John Doe    12345     john.doe@example.com    CA  2024-03-29

In [21]:
# upper case
dataframeData["customer_name"].str.upper()

0    ALICE JONES
1     JANE SMITH
2       JOHN DOE
Name: customer_name, dtype: object

In [22]:
# add Mr initially
dataframeData["customer_name"] = "MR." + dataframeData['customer_name']

In [23]:
dataframeData

    customer_name zip_code                    email state Todays_date
0  MR.Alice Jones     0000  alice.jones@example.com    TX  2024-03-29
1   MR.Jane Smith     0000   jane.smith@example.com    NY  2024-03-29
2     MR.John Doe    12345     john.doe@example.com    CA  2024-03-29

In [24]:
dataframeData['zip_code'].replace('0000', '12345')

0    12345
1    12345
2    12345
Name: zip_code, dtype: object

In [25]:
dataframeData

    customer_name zip_code                    email state Todays_date
0  MR.Alice Jones     0000  alice.jones@example.com    TX  2024-03-29
1   MR.Jane Smith     0000   jane.smith@example.com    NY  2024-03-29
2     MR.John Doe    12345     john.doe@example.com    CA  2024-03-29

## 2

In [110]:
tableName = "sanket-c.Temp.order_table"

In [111]:
dataToRead = pd.read_gbq("sanket-c.Temp.order_table")

In [112]:
dataToRead

  customer_id  order_value product_category
0   customer4         35.0         Clothing
1   customer2         25.0         Clothing
2   customer3        320.7       Appliances
3   customer3        150.0       Appliances
4   customer5        211.0      Electronics
5   customer1        100.6      Electronics

In [129]:
sqlQuery = 'select product_category, ceil(sum(order_value)) as total_revenue from `sanket-c.Temp.order_table` group by product_category'

In [130]:
newData = client.query(sqlQuery)

In [131]:
newDataToRead = newData.to_dataframe()

In [135]:
try:
    newDataToRead.to_gbq("sanket-c.Temp.grouped_table")
    print('Table grouped_table created in dataset Temp for project sanket-c')
    print(len(newDataToRead), ' records inserted')
except:
    print('table already exist')

100%|██████████| 1/1 [00:00<?, ?it/s]

Table grouped_table created in dataset Temp for project sanket-c
3  records inserted

In [137]:
newDataToRead

  product_category  total_revenue
0         Clothing           60.0
1       Appliances          471.0
2      Electronics          312.0

# Python code

In [76]:
# 1
def check_duplicates(sen):
    sen = sen.split()
    for i in sen:
        if sen.count(i) > 1:
            return True
        else:
            return False
        
check_duplicates(input('Enter a string - '))

Enter a stringsanket is sanket

True

In [138]:
# 2
def encodestring(sen):
    st = sen.split('000')
    dictName = {}

    dictName['first_name'] = st[0]
    dictName['last_name'] = st[1]
    dictName['id'] = st[2]
    return dictName

encodestring("John000Doe000123")

{'first_name': 'John', 'last_name': 'Doe', 'id': '123'}

In [140]:
# 3
def lar_smallest_no(l):
    smallest = l[0]
    largest = l[0]

    for i in l:
        if i < smallest:
            smallest = i
        if i > largest:
            largest = i
    return print(f'smallest - {smallest} \nlargest - {largest}')
        
    
lar_smallest_no([11,17,19,76,99])

smallest - 11
largest - 99